content-org/java.org
:PROPERTIES:
:DIR:      static/img/
:END:
#+HUGO_BASE_DIR: ../
#+PROPERTY: EXPORT_HUGO_SECTION notes/programming
#+OPTIONS: tags:nil \n:t
#+PROPERTY: header-args :results output :exports both
#+HUGO_CUSTOM_FRONT_MATTER: :toc true
#+HUGO_CUSTOM_FRONT_MATTER: :math true
#+HUGO_PAIRED_SHORTCODES: box
#+title: Java


* Variables and Constants

** Enumerated Types

Sometimes a varible should only hold restricted set of values.

ex: clothes has sizes small,Medium,Large,Extra Large.

An *enumerated type* has finite number of named values.


#+begin_src java
enum size { SMALL , MEDIUM , LARGE , EXTRA_LARGE };

// declare varible of this type

Size s = Size.SMALL;
#+end_src

A variable of enumerated type can hold one of the values listed int the type declaration or null.



* Strings

** Substrings

*substring* method to get substring from a larger string.

#+begin_src java
String name = 'Hemsworth';
String sub_name = name.substring(0,3);

// Creates string 'Hem'
#+end_src
